driver-tests/bpelse/assign/AssignBpel/build/Assign/NodeFunction.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:ns="urn:DataType" xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="urn:NodeFunctionTNS" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="NodeFunctionWsdl" targetNamespace="urn:NodeFunctionTNS">
    <import location="MostDataType.xsd" namespace="urn:DataType"/>
    <message name="NodeFunctionMessage">
        <part element="ns:stringPart" name="NodeFunctionPart"/>
    </message>
    <portType name="NodeFunctionPortType">
        <operation name="NodeFunctionOperation">
            <input message="tns:NodeFunctionMessage"/>
            <output message="tns:NodeFunctionMessage"/>
        </operation>
        <operation name="NodeFunctionOperation2">
            <input message="tns:NodeFunctionMessage"/>
            <output message="tns:NodeFunctionMessage"/>
        </operation>
    </portType>
    <binding name="NodeFunctionBinding" type="tns:NodeFunctionPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="NodeFunctionOperation">
            <soap:operation soapAction="NodeFunctionOperation"/>
            <input>
                <soap:body parts="NodeFunctionPart" use="literal"/>
            </input>
            <output>
                <soap:body parts="NodeFunctionPart" use="literal"/>
            </output>
        </operation>
        <operation name="NodeFunctionOperation2">
            <soap:operation soapAction="NodeFunctionOperation2"/>
            <input>
                <soap:body parts="NodeFunctionPart" use="literal"/>
            </input>
            <output>
                <soap:body parts="NodeFunctionPart" use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="NodeFunctionService">
        <port binding="tns:NodeFunctionBinding" name="NodeFunctionPort">
            <soap:address location="http://localhost:${HttpDefaultPort}/service/NodeFunction"/>
        </port>
    </service>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="NodeFunctionPLT">
        <plnk:role name="server" portType="tns:NodeFunctionPortType"/>
    </plnk:partnerLinkType>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="NodeFunctionPLT2">
        <plnk:role name="server" portType="tns:NodeFunctionPortType"/>
    </plnk:partnerLinkType>
</definitions>
