driver-tests/bpelse/assign/AssignJbi/test/CopystringInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <stringPart>
	<xsd_string>String</xsd_string>
	<optional_string>Optional Data</optional_string>
	<repeat_string>Repeating Data #1</repeat_string>
	<repeat_string>Repeating Data #2</repeat_string>
   </stringPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>